/* File Upload multiple photos label */
"# Photos (file upload on page label for multiple photos)" = "%@ kuvaa";

/* File Upload images and videos label */
"# Photos and # Videos (file upload on page label for image and videos)" = "%@ ja %@";

/* File Upload multiple videos label */
"# Videos (file upload on page label for multiple videos)" = "%@ videota";

/* accessibility help text for media controller time value >= 1 day */
"%1$d days %2$d hours %3$d minutes %4$d seconds" = "%1$d päivää %2$d tuntia %3$d minuuttia %4$d sekuntia";

/* accessibility help text for media controller time value >= 60 minutes */
"%1$d hours %2$d minutes %3$d seconds" = "%1$d tuntia %2$d minuuttia %3$d sekuntia";

/* accessibility help text for media controller time value >= 60 seconds */
"%1$d minutes %2$d seconds" = "%1$d minuuttia %2$d sekuntia";

/* accessibility help text for media controller time value < 60 seconds */
"%1$d seconds" = "%1$d sekuntia";

/* window title for a standalone image (uses multiplication symbol, not x) */
"%@ %@×%@ pixels" = "%@ %@×%@ pikseliä";

/* visible name of the plug-in host process. The first argument is the plug-in name and the second argument is the application name. */
"%@ (%@ Internet plug-in)" = "%@ (ohjelman %@ internet-liitännäinen)";

/* Text track display name format that includes the language of the subtitle, in the form of 'Title (Language)' */
"%@ (%@)" = "%@ (%@)";

/* Text track display name format that includes the country and language of the subtitle, in the form of 'Title (Language-Country)' */
"%@ (%@-%@)" = "%@ (%@–%@)";

/* Text track contains closed captions */
"%@ CC" = "%@ (CC)";

/* visible name of the database process. The argument is the application name. */
"%@ Database Storage" = "Ohjelman %@ tietokannan tallennus";

/* Text track contains simplified (3rd grade level) subtitles */
"%@ Easy Reader" = "%@ (helppolukuinen)";

/* visible name of the network process. The argument is the application name. */
"%@ Networking" = "Ohjelman %@ verkko";

/* Text track contains subtitles for the deaf and hard of hearing */
"%@ SDH" = "%@ (SDH)";

/* Visible name of the web process. The argument is the application name. */
"%@ Web Content" = "Ohjelman %@ verkkosisältö";

/* Name of application's single WebCrypto master key in Keychain */
"%@ WebCrypto Master Key" = "Ohjelman %@ WebCrypto-pääavain";

/* Label to describe the number of files selected in a file upload control that allows multiple files */
"%d files" = "%d tiedostoa";

/* Label for PDF page number indicator. */
"%d of %d" = "%d / %d";

/* Present the number of selected <option> items in a <select multiple> element (iOS only) */
"%zu Items" = "%zu kohdetta";

/* Present the element <select multiple> when no <option> items are selected (iOS only) */
"0 Items" = "0 kohdetta";

/* Present the element <select multiple> when a single <option> is selected (iOS only) */
"1 Item" = "1 kohde";

/* File Upload single photo label */
"1 Photo (file upload on page label for one photo)" = "1 kuva";

/* File Upload single video label */
"1 Video (file upload on page label for one video)" = "1 video";

/* Menu item title for KEYGEN pop-up menu */
"1024 (Medium Grade)" = "1024 (normaali)";

/* Menu item title for KEYGEN pop-up menu */
"2048 (High Grade)" = "2048 (vahva)";

/* Menu item title for KEYGEN pop-up menu */
"512 (Low Grade)" = "512 (heikko)";

/* window title for a standalone image (uses multiplication symbol, not x) */
"<filename> %d×%d pixels" = "<filename> %d×%d pikseliä";

/* WKErrorJavaScriptExceptionOccurred description */
"A JavaScript exception occurred" = "JavaScript-poikkeus";

/* Title for Add to Reading List action button */
"Add to Reading List" = "Lisää lukulistalle";

/* Undo action name */
"Align Left (Undo action name)" = "vasemmalle tasaus";

/* Undo action name */
"Align Right (Undo action name)" = "oikealle tasaus";

/* WKErrorUnknown description */
"An unknown error occurred" = "Tapahtui tuntematon virhe";

/* Menu item label for automatic track selection behavior */
"Auto (Recommended)" = "automaattinen (suositellaan)";

/* Back context menu item */
"Back" = "Edellinen";

/* Label text to be used if plugin is blocked by a page's Content Security Policy */
"Blocked Plug-In (Blocked by page's Content Security Policy)" = "Estetty liitännäinen";

/* Label text to be used when an insecure plug-in version was blocked from loading */
"Blocked Plug-In (Insecure plug-in)" = "Estetty liitännäinen";

/* Bold context menu item */
"Bold" = "Lihavoi";

/* Undo action name */
"Bold (Undo action name)" = "lihavointi";

/* menu item title for phone number */
"Call Using iPhone:" = "Soita iPhonella:";

/* File Upload alert sheet button string to cancel */
"Cancel (file upload action sheet)" = "Kumoa";

/* Title for Cancel button label in button bar */
"Cancel button label in button bar" = "Kumoa";

/* Capitalize context menu item */
"Capitalize" = "Jokainen sana isolla alkukirjaimella";

/* Undo action name */
"Center (Undo action name)" = "keskelle tasaus";

/* Undo action name */
"Change Attributes (Undo action name)" = "attribuuttien vaihto";

/* Check spelling context menu item */
"Check Document Now" = "Tarkista dokumentti nyt";

/* Check grammar with spelling context menu item */
"Check Grammar With Spelling" = "Tarkista kielioppi oikeinkirjoituksen ohessa";

/* Check spelling while typing context menu item */
"Check Spelling While Typing" = "Tarkista oikeinkirjoitus kirjoitettaessa";

/* title for a single file chooser button used in HTML forms */
"Choose File" = "Valitse tiedosto";

/* title for a multiple file chooser button used in HTML forms. This title should be as short as possible. */
"Choose Files" = "Valitse tiedostot";

/* Title for file button used in HTML5 forms for multiple media files */
"Choose Media (Multiple)" = "Valitse media (useita)";

/* Title for file button used in HTML forms for media files */
"Choose Media (Single)" = "Valitse media (yksi)";

/* Clear button in date input popover */
"Clear Button Date Popover" = "Tyhjennä";

/* menu item in Recent Searches menu that empties menu's contents */
"Clear Recent Searches" = "Poista äskeiset haut";

/* Message to display in browser window when in webkit full screen mode. */
"Click to exit full screen mode" = "Poistu koko näytön tilasta osoittamalla";

/* Subtitle of the label to show on a snapshotted plug-in */
"Click to restart" = "Käynnistä uudelleen osoittamalla";

/* WebKitErrorCannotShowMIMEType description */
"Content with specified MIME type can’t be shown" = "Sisältöä ei voida näyttää määritetylle MIME-tyypille";

/* Media Controls context menu item */
"Controls" = "Säätimet";

/* Copy context menu item */
"Copy" = "Kopioi";

/* Title for Copy Link or Image action button */
"Copy ActionSheet Link" = "Kopioi";

/* Copy Audio Address Location context menu item */
"Copy Audio Address" = "Kopioi äänen osoite";

/* Copy Image context menu item */
"Copy Image" = "Kopioi kuva";

/* Copy Link context menu item */
"Copy Link" = "Kopioi linkki";

/* Copy Video Address Location context menu item */
"Copy Video Address" = "Kopioi videon osoite";

/* Correct Spelling Automatically context menu item */
"Correct Spelling Automatically" = "Korjaa oikeinkirjoitus automaattisesti";

/* Undo action name */
"Create Link (Undo action name)" = "linkin luonti";

/* Cut context menu item */
"Cut" = "Leikkaa";

/* Undo action name */
"Cut (Undo action name)" = "leikkaaminen";

/* Default writing direction context menu item */
"Default" = "Oletus";

/* Undo action name (Used only by PLATFORM(IOS) code) */
"Delete (Undo action name)" = "Poista";

/* text to display in <details> tag when it has no <summary> child */
"Details" = "Lisätietoja";

/* Undo action name (Used only by PLATFORM(IOS) code) */
"Dictation (Undo action name)" = "Sanelu";

/* Download Audio To Disk context menu item */
"Download Audio" = "Lataa ääni";

/* Download Image context menu item */
"Download Image" = "Lataa kuva";

/* Download Linked File context menu item */
"Download Linked File" = "Lataa linkitetty tiedosto";

/* Download Video To Disk context menu item */
"Download Video" = "Lataa video";

/* Undo action name */
"Drag (Undo action name)" = "veto";

/* Video Enter Fullscreen context menu item */
"Enter Full Screen" = "Siirry koko näytön tilaan";

/* Video Exit Fullscreen context menu item */
"Exit Full Screen" = "Poistu koko näytön tilasta";

/* Default application name for Open With context menu */
"Finder" = "Finder";

/* Font context sub-menu item */
"Font" = "Fontti";

/* Undo action name */
"Format Block (Undo action name)" = "muotoilu";

/* Forward context menu item */
"Forward" = "Seuraava";

/* WebKitErrorFrameLoadInterruptedByPolicyChange description */
"Frame load interrupted" = "Kehyksen haku keskeytetty";

/* accessibility role description for web area */
"HTML content" = "HTML-sisältö";

/* Hide Media Controls context menu item */
"Hide Controls" = "Kätke säätimet";

/* menu item title */
"Hide Spelling and Grammar" = "Kätke oikeinkirjoitus ja kielioppi";

/* menu item title */
"Hide Substitutions" = "Kätke korvaukset";

/* The default, default character encoding on Windows */
"ISO-8859-1" = "ISO-8859-1";

/* Ignore Grammar context menu item */
"Ignore Grammar" = "Älä huomioi kielioppia";

/* Ignore Spelling context menu item */
"Ignore Spelling" = "Älä huomioi oikeinkirjoitusta";

/* Undo action name */
"Indent (Undo action name)" = "sisennys";

/* Undo action name */
"Insert List (Undo action name)" = "luettelon lisäys";

/* Inspect Element context menu item */
"Inspect Element" = "Tarkista elementti";

/* Italic context menu item */
"Italic" = "Kursivoi";

/* Undo action name */
"Italics (Undo action name)" = "kursivointi";

/* WebKitErrorJavaUnavailable description */
"Java is unavailable" = "Java ei ole käytettävissä";

/* Title for action sheet for JavaScript link */
"JavaScript Action Sheet Title" = "JavaScript";

/* Undo action name */
"Justify (Undo action name)" = "reunoihin tasaus";

/* Name of keychain key generated by the KEYGEN tag */
"Key from %@" = "Avain kohteelta %@";

/* Learn Spelling context menu item */
"Learn Spelling" = "Opi oikeinkirjoitus";

/* Left to Right context menu item */
"Left to Right" = "Vasemmalta oikealle";

/* Media controller status message when watching a live broadcast */
"Live Broadcast" = "Suora lähetys";

/* Media controller status message when the media is loading */
"Loading..." = "Ladataan...";

/* Look Up in Dictionary context menu item */
"Look Up in Dictionary" = "Etsi Sanakirjasta";

/* Look Up context menu item with selected word */
"Look Up “%@”" = "Etsi ”%@” sanakirjasta";

/* Look Up context menu item with selected word */
"Look Up “<selection>”" = "Etsi ”<selection>” sanakirjasta";

/* Media Loop context menu item */
"Loop" = "Silmukoi";

/* Undo action name */
"Loosen Kerning (Undo action name)" = "välistyksen harvennus";

/* Undo action name */
"Lower Baseline (Undo action name)" = "peruslinjan alentaminen";

/* Make Lower Case context menu item */
"Make Lower Case" = "Muuta pieniksi kirjaimiksi";

/* Make Upper Case context menu item */
"Make Upper Case" = "Muuta isoiksi kirjaimiksi";

/* Label text to be used when a plugin is missing */
"Missing Plug-in" = "Ei liitännäistä";

/* Media Mute context menu item */
"Mute" = "Mykistä";

/* No Guesses Found context menu item */
"No Guesses Found" = "Ei arvauksia";

/* Empty select list */
"No Options Select Popover" = "Ei valintoja";

/* Label for only item in menu that appears when clicking on the search field image, when no searches have been performed */
"No recent searches" = "Ei äskeisiä hakuja";

/* WebKitErrorCannotUseRestrictedPort description */
"Not allowed to use restricted network port" = "Rajoitetun verkkoportin käyttö ei ole sallittua";

/* Menu item label for the track that represents disabling closed captions */
"Off" = "Pois";

/* Title for Open Link action button */
"Open ActionSheet Link" = "Avaa";

/* Open Audio in New Window context menu item */
"Open Audio in New Window" = "Avaa ääni uudessa ikkunassa";

/* Open Frame in New Window context menu item */
"Open Frame in New Window" = "Avaa kehys uudessa ikkunassa";

/* Open Image in New Window context menu item */
"Open Image in New Window" = "Avaa kuva uudessa ikkunassa";

/* Open Link context menu item */
"Open Link" = "Avaa linkki";

/* Open in New Window context menu item */
"Open Link in New Window" = "Avaa linkki uudessa ikkunassa";

/* Open Video in New Window context menu item */
"Open Video in New Window" = "Avaa video uudessa ikkunassa";

/* context menu item for PDF */
"Open with %@" = "Avaa ohjelmalla %@";

/* Undo action name */
"Outdent (Undo action name)" = "ulonnus";

/* Outline context menu item */
"Outline" = "Reunusta";

/* Undo action name */
"Outline (Undo action name)" = "reunustus";

/* Paragraph direction context sub-menu item */
"Paragraph Direction" = "Kappaleen suunta";

/* Paste context menu item */
"Paste" = "Sijoita";

/* Undo action name */
"Paste (Undo action name)" = "sijoitus";

/* Undo action name */
"Paste Font (Undo action name)" = "fontin sijoitus";

/* Undo action name */
"Paste Ruler (Undo action name)" = "viivaimen sijoitus";

/* Media Pause context menu item */
"Pause" = "Keskeytä";

/* File Upload alert sheet button string for choosing an existing media item from the Photo Library */
"Photo Library (file upload action sheet)" = "Kuvakirjasto";

/* Media Play context menu item */
"Play" = "Toista";

/* accessibility help text for enter fullscreen button */
"Play movie in fullscreen mode" = "Toista elokuva koko näytön tilassa";

/* Label text to be used if plugin host process has crashed */
"Plug-in Failure" = "Liitännäisvirhe";

/* WebKitErrorPlugInCancelledConnection description */
"Plug-in cancelled" = "Liitännäinen kumottiin";

/* WebKitErrorPlugInWillHandleLoad description */
"Plug-in handled load" = "Liitännäisen käsittelemä sisältö";

/* Description of the primary type supported by the PDF pseudo plug-in. Visible in the Installed Plug-ins page in Safari. */
"Portable Document Format" = "PDF";

/* Description of the PostScript type supported by the PDF pseudo plug-in. Visible in the Installed Plug-ins page in Safari. */
"PostScript" = "PostScript";

/* Undo action name */
"Raise Baseline (Undo action name)" = "peruslinjan nosto";

/* label for first item in the menu that appears when clicking on the search field image, used as embedded menu title */
"Recent Searches" = "Äskeiset haut";

/* Reload context menu item */
"Reload" = "Lataa uudelleen";

/* default label for Reset buttons in forms on web pages */
"Reset" = "Palauta";

/* Right to Left context menu item */
"Right to Left" = "Oikealta vasemmalle";

/* Title for Save Image action button */
"Save Image" = "Tallenna kuva";

/* Search in Spotlight context menu item */
"Search in Spotlight" = "Etsi Spotlightilla";

/* Search with search provider context menu item with provider name inserted */
"Search with %@" = "%@-haku";

/* Search with Google context menu item */
"Search with Google" = "Etsi Googlella";

/* Selection direction context sub-menu item */
"Selection Direction" = "Valinnan suunta";

/* Undo action name */
"Set Background Color (Undo action name)" = "taustavärin asetus";

/* Undo action name */
"Set Color (Undo action name)" = "värin asetus";

/* Undo action name */
"Set Font (Undo action name)" = "fonttiasetus";

/* Undo action name */
"Set Traditional Character Shape (Undo action name)" = "perinteisen merkkimuodon asetus";

/* Undo action name */
"Set Writing Direction (Undo action name)" = "kirjoituksen suunnan asetus";

/* Show colors context menu item */
"Show Colors" = "Näytä värit";

/* Show Media Controls context menu item */
"Show Controls" = "Näytä säätimet";

/* Show fonts context menu item */
"Show Fonts" = "Näytä fontit";

/* menu item title */
"Show Spelling and Grammar" = "Näytä oikeinkirjoitus ja kielioppi";

/* menu item title */
"Show Substitutions" = "Näytä korvaukset";

/* Title of the context menu item to show when PDFPlugin was used instead of a blocked plugin */
"Show in blocked plug-in" = "Näytä estetyssä liitännäisessä";

/* Smart Copy/Paste context menu item */
"Smart Copy/Paste" = "Älykäs kopiointi/sijoitus";

/* Smart Dashes context menu item */
"Smart Dashes" = "Älykkäät väliviivat";

/* Smart Links context menu item */
"Smart Links" = "Älykkäät linkit";

/* Smart Quotes context menu item */
"Smart Quotes" = "Älykkäät lainausmerkit";

/* Title of the label to show on a snapshotted plug-in */
"Snapshotted Plug-In" = "Tilannevedostettu liitännäinen";

/* Speech context sub-menu item */
"Speech" = "Puhe";

/* Spelling and Grammar context sub-menu item */
"Spelling and Grammar" = "Oikeinkirjoitus ja kielioppi";

/* title for Start Debugging JavaScript menu item */
"Start Debugging JavaScript" = "Aloita JavaScriptin vianmääritys";

/* title for Start Profiling JavaScript menu item */
"Start Profiling JavaScript" = "Aloita JavaScriptin profilointi";

/* Start speaking context menu item */
"Start Speaking" = "Aloita puhuminen";

/* Stop context menu item */
"Stop" = "Keskeytä";

/* title for Stop Debugging JavaScript menu item */
"Stop Debugging JavaScript" = "Lopeta JavaScriptin vianmääritys";

/* title for Stop Profiling JavaScript menu item */
"Stop Profiling JavaScript" = "Lopeta JavaScriptin profilointi";

/* Stop speaking context menu item */
"Stop Speaking" = "Lopeta puhuminen";

/* Styles context menu item */
"Styles..." = "Tyylit...";

/* default label for Submit buttons in forms on web pages */
"Submit" = "Lähetä";

/* alt text for <input> elements with no alt, title, or value */
"Submit (input element)" = "Lähetä";

/* Undo action name */
"Subscript (Undo action name)" = "alaindeksointi";

/* Substitutions context sub-menu item */
"Substitutions" = "Korvaukset";

/* Menu section heading for subtitles */
"Subtitles" = "Tekstitys";

/* Undo action name */
"Superscript (Undo action name)" = "yläindeksointi";

/* File Upload alert sheet camera button string for taking only photos */
"Take Photo (file upload action sheet)" = "Ota kuva";

/* File Upload alert sheet camera button string for taking photos or videos */
"Take Photo or Video (file upload action sheet)" = "Ota kuva tai videoi";

/* File Upload alert sheet camera button string for taking only videos */
"Take Video (file upload action sheet)" = "Videoi";

/* Text Replacement context menu item */
"Text Replacement" = "Tekstin korvaus";

/* WebKitErrorCannotShowURL description */
"The URL can’t be shown" = "Osoitetta ei voida näyttää";

/* WKErrorWebViewInvalidated description */
"The WKWebView was invalidated" = "WKWebView mitätöitiin";

/* WKErrorWebContentProcessTerminated description */
"The Web Content process was terminated" = "Verkkosisältöprosessi lopetettiin";

/* WebKitErrorGeolocationLocationUnknown description */
"The current location cannot be found." = "Nykyistä sijaintia ei löytynyt.";

/* WebKitErrorCannotFindPlugin description */
"The plug-in can’t be found" = "Liitännäistä ei löydy";

/* WebKitErrorCannotLoadPlugin description */
"The plug-in can’t be loaded" = "Liitännäistä ei voida ladata";

/* prompt string in authentication panel */
"The user name or password you entered for area “%@” on %@ was incorrect. Make sure you’re entering them correctly, and then try again." = "Alueelle ”%@” (%@) syöttämäsi käyttäjätunnus tai salasana oli virheellinen. Varmista, että syötät ne oikein, ja yritä uudelleen.";

/* prompt string in authentication panel */
"The user name or password you entered for the %@ proxy server %@ was incorrect. Make sure you’re entering them correctly, and then try again." = "Välipalvelimelle %@ (%@) syöttämäsi käyttäjätunnus tai salasana oli virheellinen. Varmista, että syötät ne oikein, ja yritä uudelleen.";

/* prompt string in authentication panel */
"The user name or password you entered for this area on %@ was incorrect. Make sure you’re entering them correctly, and then try again." = "Syöttämäsi käyttäjätunnus tai salasana tälle alueelle osoitteessa %@ oli virheellinen. Varmista, että syötät ne oikein, ja yritä uudelleen.";

/* text that appears at the start of nearly-obsolete web pages in the form of a 'searchable index' */
"This is a searchable index. Enter search keywords: " = "Indeksistä voidaan tehdä hakuja. Etsi avainsanoja: ";

/* Undo action name */
"Tighten Kerning (Undo action name)" = "välistyksen tiivistys";

/* prompt string in authentication panel */
"To view this page, you must log in to area “%@” on %@." = "Jos haluat nähdä sivun, sinun täytyy kirjautua alueelle ”%@” (%@).";

/* prompt string in authentication panel */
"To view this page, you must log in to the %@ proxy server %@." = "Jos haluat nähdä sivun, sinun täytyy kirjautua välipalvelimelle %@ (%@).";

/* prompt string in authentication panel */
"To view this page, you must log in to this area on %@:" = "Voit katsella sivua kirjautumalla alueelle osoitteessa %@:";

/* Transformations context sub-menu item */
"Transformations" = "Muunnokset";

/* Undo action name */
"Turn Off Kerning (Undo action name)" = "välistyksen poisto";

/* Undo action name */
"Turn Off Ligatures (Undo action name)" = "ligatuurien poisto";

/* We don't care if we find this string, but searching for it will load the plist and save the results. */
"Typing (Undo action name)" = "kirjoitus";

/* Underline context menu item */
"Underline" = "Alleviivaa";

/* Undo action name */
"Underline (Undo action name)" = "alleviivaus";

/* Unknown filesize FTP directory listing item */
"Unknown (filesize)" = "Tuntematon";

/* Menu item label for a text track that has no other name */
"Unknown (text track)" = "Tuntematon";

/* Undo action name */
"Unlink (Undo action name)" = "linkin poisto";

/* Undo action name */
"Unscript (Undo action name)" = "indeksin poisto";

/* Undo action name */
"Use All Ligatures (Undo action name)" = "kaikkien ligatuurien käyttö";

/* Undo action name */
"Use Standard Kerning (Undo action name)" = "vakioparivälistyksen käyttö";

/* Undo action name */
"Use Standard Ligatures (Undo action name)" = "vakioligatuurien käyttö";

/* Description of WebCrypto master keys in Keychain */
"Used to encrypt WebCrypto keys in persistent storage, such as IndexedDB" = "Käytetään WebCrypto-avaimien salaamiseen pysyvässä tallennuspaikassa, kuten IndexedDB:ssä";

/* Web Inspector window title */
"Web Inspector — %@" = "Verkkoinspektori — %@";

/* Pseudo plug-in name, visible in the Installed Plug-ins page in Safari. */
"WebKit built-in PDF" = "WebKitin sisäinen PDF";

/* WebKitErrorInternal description */
"WebKit encountered an internal error" = "WebKitin sisäinen virhe";

/* message in authentication panel */
"Your login information will be sent securely." = "Kirjautumistiedot lähetetään suojatussa muodossa.";

/* message in authentication panel */
"Your password will be sent unencrypted." = "Salasana lähetetään salaamattomana.";

/* HTTP result code string */
"accepted" = "hyväksytty";

/* Verb stating the action that will occur when a text field is selected, as used by accessibility */
"activate" = "ota käyttöön";

/* An ARIA accessibility group that acts as an alert. */
"alert" = "varoitus";

/* An ARIA accessibility group that acts as an alert dialog. */
"alert dialog" = "varoitusikkuna";

/* An ARIA accessibility group that acts as an application. */
"application" = "ohjelma";

/* An ARIA accessibility group that acts as a status update. */
"application status" = "ohjelman tila";

/* An ARIA accessibility group that acts as an article. */
"article" = "artikkeli";

/* accessibility help text for audio element controller */
"audio element playback controls and status display" = "äänielementin toistosäätimet ja tilanäyttö";

/* accessibility label for audio element controller */
"audio playback" = "äänentoisto";

/* accessibility label for seek back 30 seconds button */
"back 30 seconds" = "taaksepäin 30 sekuntia";

/* HTTP result code string */
"bad gateway" = "virheellinen yhdyskäytävä";

/* HTTP result code string */
"bad request" = "virheellinen pyyntö";

/* An ARIA accessibility group that acts as a banner. */
"banner" = "banneri";

/* accessibility help text for play button */
"begin playback" = "aloita toisto";

/* accessibility description for a search field cancel button */
"cancel" = "kumoa";

/* Verb stating the action that will occur when an unchecked checkbox is clicked, as used by accessibility */
"check" = "valitse";

/* HTTP result code string */
"client error" = "asiakasvirhe";

/* An ARIA accessibility group that acts as a region of complementary information. */
"complementary" = "täydentävä";

/* HTTP result code string */
"conflict" = "ristiriita";

/* An ARIA accessibility group that contains content. */
"content information" = "sisällön tiedot";

/* HTTP result code string */
"continue" = "jatka";

/* HTTP result code string */
"created" = "luotu";

/* accessibility help text for movie status display */
"current movie status" = "nykyisen elokuvan tila";

/* accessibility help text for elapsed time display */
"current movie time in seconds" = "nykyisen elokuvan aika sekunneissa";

/* role description of ARIA definition role */
"definition" = "määritelmä";

/* description detail */
"description" = "kuvaus";

/* accessibility role description of a description list */
"description list" = "luettelo kuvauksista";

/* An ARIA accessibility group that acts as an dialog. */
"dialog" = "valintaikkuna";

/* An ARIA accessibility group that acts as a document. */
"document" = "dokumentti";

/* accessibility label for elapsed time display */
"elapsed time" = "kulunut aika";

/* accessibility label for enter fullscreen button */
"enter fullscreen" = "koko näytön tilaan";

/* accessibility label for exit fullscreen button */
"exit fullscreen" = "poistu koko näytön tilasta";

/* HTTP result code string */
"expectation failed" = "odotus epäonnistui";

/* accessibility label for fast forward button */
"fast forward" = "selaa eteenpäin";

/* accessibility label for fast reverse button */
"fast reverse" = "nopeasti taaksepäin";

/* accessibility role description for a file upload button */
"file upload button" = "tiedostonsiirtopainike";

/* accessibility role description for a footer */
"footer" = "alaviite";

/* HTTP result code string */
"forbidden" = "kielletty";

/* HTTP result code string */
"found" = "löytyi";

/* HTTP result code string */
"gateway timed out" = "yhdyskäytävä aikakatkaistiin";

/* accessibility role description for headings */
"heading" = "otsikko";

/* accessibility label for hide closed captions button */
"hide closed captions" = "Kätke kuvaileva tekstitys";

/* accessibility role description for image map */
"image map" = "kuvakartta";

/* accessibility help text for an indefinite media controller time value */
"indefinite time" = "määrittämätön aika";

/* HTTP result code string */
"informational" = "tieto";

/* HTTP result code string */
"internal server error" = "palvelimen sisäinen virhe";

/* Verb stating the action that will occur when a link is clicked, as used by accessibility */
"jump" = "siirry";

/* HTTP result code string */
"length required" = "pituus vaaditaan";

/* accessibility role description for link */
"link" = "linkki";

/* accessibility role description for list marker */
"list marker" = "luettelomerkki";

/* An ARIA accessibility group that acts as a console log. */
"log" = "loki";

/* An ARIA accessibility group that is the main portion of the website. */
"main" = "pää";

/* An ARIA accessibility group that acts as a marquee. */
"marquee" = "markiisi";

/* An ARIA accessibility group that contains mathematical symbols. */
"math" = "matematiikka";

/* HTTP result code string */
"method not allowed" = "menetelmä ei sallittu";

/* HTTP result code string */
"moved permanently" = "siirretty pysyvästi";

/* accessibility label for timeline slider */
"movie time" = "elokuvan aika";

/* accessibility help text for timeline slider */
"movie time scrubber" = "elokuvan ajan selauspalkki";

/* accessibility help text for timeline slider thumb */
"movie time scrubber thumb" = "elokuvan ajan selauspalkin miniatyyri";

/* HTTP result code string */
"multiple choices" = "useita vaihtoehtoja";

/* accessibility label for mute button */
"mute" = "mykistä";

/* accessibility help text for mute button */
"mute audio tracks" = "mykistä ääniraidat";

/* An ARIA accessibility group that contains the main navigation elements of a website. */
"navigation" = "selaus";

/* HTTP result code string */
"needs proxy" = "tarvitsee välipalvelimen";

/* HTTP result code string */
"no content" = "ei sisältöä";

/* HTTP result code string */
"no error" = "ei virhettä";

/* text to display in file button used in HTML forms when no file is selected */
"no file selected" = "tiedostoa ei ole valittu";

/* text to display in file button used in HTML forms when no files are selected and the button allows multiple files to be selected */
"no files selected" = "tiedostoja ei ole valittu";

/* HTTP result code string */
"no longer exists" = "ei ole enää olemassa";

/* Text to display in file button used in HTML forms for media files when no media files are selected and the button allows multiple files to be selected */
"no media selected (multiple)" = "mediaa ei ole valittu (useita)";

/* Text to display in file button used in HTML forms for media files when no media file is selected */
"no media selected (single)" = "mediaa ei ole valittu (yksi)";

/* HTTP result code string */
"non-authoritative information" = "varmentamaton tieto";

/* HTTP result code string */
"not found" = "ei löytynyt";

/* HTTP result code string */
"not modified" = "ei muokattu";

/* An ARIA accessibility group that acts as a note in a document. */
"note" = "muistiinpano";

/* accessibility help text for remaining time display */
"number of seconds of movie remaining" = "elokuvan jäljellä oleva aika sekunneissa";

/* HTTP result code string */
"partial content" = "osittainen sisältö";

/* Validation message for input form controls requiring a constrained value according to pattern */
"pattern mismatch" = "kuvio ei täsmää";

/* accessibility label for pause button */
"pause" = "keskeytä";

/* accessibility help text for pause button */
"pause playback" = "keskeytä toisto";

/* HTTP result code string */
"payment required" = "maksu vaaditaan";

/* accessibility label for play button */
"play" = "toista";

/* HTTP result code string */
"precondition failed" = "ennakkoehto epäonnistui";

/* Verb stating the action that will occur when a button is pressed, as used by accessibility */
"press" = "paina";

/* HTTP result code string */
"proxy authentication required" = "välipalvelimen todentaminen vaaditaan";

/* Validation message for input form controls with value higher than allowed maximum */
"range overflow" = "alueen ylivuoto";

/* Validation message for input form controls with value lower than allowed minimum */
"range underflow" = "alueen alivuoto";

/* HTTP result code string */
"redirected" = "uudelleenohjattu";

/* An ARIA accessibility group that acts as a distinct region in a document. */
"region" = "alue";

/* accessibility label for time remaining display */
"remaining time" = "jäljellä oleva aika";

/* HTTP result code string */
"request timed out" = "pyyntö aikakatkaistiin";

/* HTTP result code string */
"request too large" = "pyyntö liian suuri";

/* HTTP result code string */
"requested URL too long" = "pyydetty osoite liian pitkä";

/* HTTP result code string */
"requested range not satisfiable" = "pyydetty alue virheellinen";

/* HTTP result code string */
"reset content" = "nollaa sisältö";

/* accessibility help text for return streaming movie to real time button */
"return streaming movie to real time" = "palauta suoratoistoelokuva reaaliaikaan";

/* accessibility label for return to real time button */
"return to realtime" = "palauta reaaliaikaan";

/* An ARIA accessibility group that contains a search feature of a website. */
"search" = "etsi";

/* HTTP result code string */
"see other" = "katso muu";

/* accessibility help text for jump back 30 seconds button */
"seek movie back 30 seconds" = "etsi elokuvaa taaksepäin 30 sekuntia";

/* accessibility help text for fast rewind button */
"seek quickly back" = "etsi nopeasti taaksepäin";

/* accessibility help text for fast forward button */
"seek quickly forward" = "etsi nopeasti eteenpäin";

/* Verb stating the action that will occur when a radio button is clicked, as used by accessibility */
"select" = "valitse";

/* accessibility role description for a horizontal rule [<hr>] */
"separator" = "erotin";

/* HTTP result code string */
"server error" = "palvelinvirhe";

/* HTTP result code string */
"service unavailable" = "palvelu ei käytettävissä";

/* accessibility label for show closed captions button */
"show closed captions" = "näytä kuvaileva tekstitys";

/* accessibility help text for show closed captions button */
"start displaying closed captions" = "aloita kuvailevan tekstityksen näyttäminen";

/* accessibility label for movie status */
"status" = "tila";

/* Validation message for input form controls with value not respecting the step attribute */
"step mismatch" = "askel ei täsmää";

/* accessibility help text for hide closed captions button */
"stop displaying closed captions" = "lopeta kuvailevan tekstityksen näyttäminen";

/* HTTP result code string */
"success" = "onnistui";

/* HTTP result code string */
"switching protocols" = "vaihdetaan protokollia";

/* An ARIA accessibility group that contains the content of a tab. */
"tab panel" = "välilehtipaneeli";

/* HTTP result code string */
"temporarily redirected" = "väliaikaisesti uudelleenohjattu";

/* term word of a description list */
"term" = "termi";

/* accessibility label for timeline thumb */
"timeline slider thumb" = "aikajanan liukusäätimen miniatyyri";

/* An ARIA accessibility group that acts as an updating timer. */
"timer" = "ajastin";

/* Validation message for form control elements with a value longer than maximum allowed length */
"too long" = "liian pitkä";

/* An ARIA accessibility group that acts as a tooltip. */
"tooltip" = "työkaluvinkki";

/* Validation message for input form controls with a value not matching type */
"type mismatch" = "tyyppi ei täsmää";

/* HTTP result code string */
"unacceptable" = "ei kelpaa";

/* HTTP result code string */
"unauthorized" = "ei valtuutettu";

/* Verb stating the action that will occur when a checked checkbox is clicked, as used by accessibility */
"uncheck" = "poista valinta";

/* HTTP result code string */
"unimplemented" = "ei toteutettu";

/* Unknown filename */
"unknown" = "tuntematon";

/* accessibility label for turn mute off button */
"unmute" = "poista mykistys";

/* accessibility help text for un mute button */
"unmute audio tracks" = "poista ääniraitojen mykistys";

/* HTTP result code string */
"unsupported media type" = "ei tuettu mediatyyppi";

/* HTTP result code string */
"unsupported version" = "ei tuettu versio";

/* Validation message for required form control elements that have no value */
"value missing" = "arvo puuttuu";

/* accessibility help text for video element controller */
"video element playback controls and status display" = "videoelementin toistosäätimet ja tilanäyttö";

/* accessibility label for video element controller */
"video playback" = "videotoisto";

/* "Open Link in Default Browser" action menu item */
"Open (action menu item)" = "Avaa";

/* "Preview Link" action menu item */
"Preview (action menu item)" = "Esikatsele";

/* "Add to Reading List" action menu item */
"Add to Reading List (action menu item)" = "Lisää lukulistalle";

/* "Copy" action menu item in image menu */
"Copy (image action menu item)" = "Kopioi";

/* "Add to Photos" action menu item */
"Add to Photos (action menu item)" = "Lisää Kuviin";

/* "Save to Downloads" action menu item in image menu */
"Save to Downloads (image action menu item)" = "Tallenna Lataukset-kansioon";

/* "Share" action menu item in image menu */
"Share (image action menu item)" = "Jaa";

/* "Copy" action menu item in text menu */
"Copy (text action menu item)" = "Kopioi";

/* "Look Up" action menu item */
"Look Up (action menu item)" = "Etsi sanakirjasta";

/* "Paste" action menu item */
"Paste (action menu item)" = "Sijoita";

/* "Suggestions" action menu item */
"Suggestions (action menu item)" = "Ehdotukset";

/* "Copy" action menu item in video menu */
"Copy (video action menu item)" = "Kopioi";

/* "Share" action menu item in video menu */
"Share (video action menu item)" = "Jaa";

/* "Save to Downloads" action menu item in video menu */
"Save to Downloads (video action menu item)" = "Tallenna Lataukset-kansioon";
